"""
ф строки это объект который имеет название строка формата, он упрощает реализацию вывода в консоль инфомации
запятая по умолчанию делает пробел
"""
n = 10
m = 100
#эволюция строки формата:
print("Первая переменная -", n, "Вторая переменная -", m, "m/n =", m//n)  # без ковычек
# выводится= Первая переменная - 10 Вторая переменная - 100 m/n = 10

# если нужно структурней написать, добавляем ковычки и удаляем между ними пробелы с помощью sep=""
print("Первая переменная - '", n, "'"","" Вторая переменная - '", m, "'"","" m/n = '", m//n,"'", sep="")
# выводится= Первая переменная - '10', Вторая переменная - '100', m/n = '10'

# %d это значит целочисленное значение int, .2f два знака после запятой float, %s str
print("Первая переменная - '%d', Вторая переменная - '%d', m/n = '%d'"%(n,m,m//n))
# выводится= тоже

print("Первая переменная - '{}', Вторая переменная - '{}', m/n = '{}'".format(n,m,m//n))
# выводится= тоже

print(f"Первая переменная - '{n}', Вторая переменная - '{m}', m/n = '{m // n}'")
# выводится= тоже

print(f"Первая переменная - '{n}',\nВторая переменная - '{m}',\nm/n = '{m // n}'")
# выводится= тоже

print(f"Первая переменная - '{n}',\nВторая переменная - '{m}',\nm/n = '{round(m / n, 2)}'")
# выводится= тоже

print(f"Первая переменная - '{n}',\nВторая переменная - '{m}',\nm/n = '{m / n:.2f}'")
# выводится= тоже

""" --------МНОЖЕСТВА-- set не упорядоченный набор уникальных объектов {,(,),'',[]} ---------------
объектами множества могут быть любые не изменяемые(иммутабельные) типы данных(int, float, str, tuple, bool)
положение элементов для нас хаотичное, но пайтон ставит в хэш таблицу не случайным образом, по своему алгаритму
множества(словари тоже) относится к структуре данных которая называется хэш таблица
списки(list) и кортежи(tuples'тьюпл') относятся к структуре данных массив
"""
# ls = [22, 22, 22, 33, 44]  # список
# st = set(ls)  # делаем множество(неупорядоченное) из списка= {33, 44, 22} без одинаковых!
# print(st)  # вывод в любом порядке и без повторений
#st.clear()  # удаляем множество при выводе= set()
# print(st) # вывод в любом порядке и без повторений множество

# st = {22, 33, 44}  # множество
# st.add(101)  # добавляет один элемент(не управляя местом) int
# st.add("105")  # str
# st.add(False)  # bool
# st.add((100, 112))  # если это кортеж(()) они будут вместе(не изменяем), tuple
# st.update({2, '3'})  # в разные места добавляет элементы коллекции, даже если это строка в словаре
# st.update({'9', 1})  # в разные места добавляет
# st.update({'9', 101.5})  # повторяющиеся приводятся к унарности(не добавляются), float
# print(st)
# выведется {False, 33, 2, 1, 101, 101.5, 44, (100, 112), '9', '105', 22, '3'}

# n = st.pop()  # удаляет первый элемент
# print(n)  # проверка какой удалится
# print(st)
# st.remove('3')  # указываем конкретное значение для удаления
# print(st)  # будет ошибка если такого значения нет!! не очень популярный метод, стопорит работу
# st.discard(4)  # ошибку не даст при отсутствии такого значения, ничего не измениться
# print(st)

# st = {22, 33, 44}
# for i in st:  # множества также итерируются
#     print(i)  # выводится тоже но в столбик

# st1 = {3, 4, 33}
# st2 = {3, 4, 44}

# res = st1.union(st2)  # создали новое множество res с объединением, приведение к унарности без повторений
# res = st1 | st2  # тоже самое {33, 3, 4, 44} (неупорядоченно)

# res = st1.intersection(st2)  # пересечение множеств {3, 4} значения которые есть и там
# res = st1 & st2  # тоже самое

# res = st1.difference(st2)  # вычитание множеств из st1 выч st2, получ то чего нет в st2 {33}
# res = st2 - st1  # тоже но в другом порядке, получ то чего нет в st1 {44}
# print(res)

# res = st1.symmetric_difference(st2)  # симметричное вычитание, получ {33, 44},
# # снач выч из st1 выч st2, потом из st2 выч st1, далее записываются в один ответ
# res = st1 ^ st2  # тоже самое {33, 44}, Shift+6 Eng= ^
# ^ карет (или циркумфлекс) побитовая операция «исключающее ИЛИ» (XOR)
# res = st2 ^ st1  # почему то тотже порядок {33, 44}
# print(res)
# # например имея два рюкзака этим методом их сравним и выявим разницу непохожесть, кто положил не тоже что и другой

# st3 = {3, 4}  # это подмножество
# print(st3.issubset(st2))  # является ли !st3 подмножеством! по отношению к множеству st2 ответ True
## («всё моё есть у тебя») "исабсет"
# print(st1.issuperset(st3))  # является ли !st1 супермножеством! по отношению к множеству st3 ответ True
## ("у меня есть всё твоё и, возможно, ещё что‑то") "исьюперсет"
# print(st2.issuperset(st3))  # True
# если у них есть общее значит да
# print(st1.issuperset(st2))  # False! является ли !st1 супермножеством! по отношению к множеству st2
## т.е. st2 полностью входит в st1- нет

"""----------СЛОВАРИ(коллекция)---------------{'': , : }--------------ключ:значение-------------------------------------
dict неупорядоченный набор пар(она же коллекция) ключ:значение в которых ключ уникален, (объект это пара)
##словари(множества тоже) относится к структуре данных которая называется хэш таблица
"""
# d = {}  # пустой словарь

# d = {"Pb": "свинец", "Au": "Золото"}
# print(d["Pb"])  # обратились к колекции по ключу, выводится свинец (при не существующем ошибка)
# # после get скобки круглые!
# print(d.get("Pb"))  # проверка, при не существующем ключе None при существующем значение ключа свинец
# print(d.get("Pb1", "my items"))  # задаем значение(не через :) и если ключа нет, выводится это значение my items
# print(d)  # с get выводилось новое значение но оно не сохранилось в настоящий словарь
#
# d["Pb"] = "Свинец"  # замена значения
# print(d["Pb"])
# print(d)
#
# d["Fe"] = "Железо"  # нет ошибки! добавление, первый способ добавления ключ:значение, которых не было
# d.setdefault("Fe", 1000)  # защита от перезаписи значения по существующему ключу, не перезапишется, 'сетдефаут'
# d.setdefault(1, 1000)  # ключ:значение добавилось, т.к. ключ новый
# print(d)
# d.update({3: 33, 1: 11})  # методом добавили в словарь d, 3:33 добавилось, 1:1000 заменилось на 1:11
# print(d)
#
# n = d.pop("Fe")  # удаление
# nn = d.popitem()  # удаление последней добавленнной(не измененной) пары "поп айтем"
# print(n, nn)
# #d.clear()
# print(d)
# print(len(d))  # объект = пара
#
# print(d.keys())  # выводим ключи ввиде списка с консрукцией dict_keys
# print(list(d))  # выводим ключи ввиде списка без консрукции dict_keys
# for o in d: # тоже что d.keys (итерируем по ключам)
#     print(i)
#
# print(list(d.values()))  # выводим список значений
# for v in d.values():  # итерируем по значениям
#     print(v)
#
# print(list(d.items()))  # "ди айтемс" получили список кортежей[(,,,)] из словаря
# for k, v in d.items():  # итерируем получаем по два элемента в столбик
#     print(k, v)

# lst = [("Pb1", "Свинец1"), ("Au1", "Золото1"), (11, 111)]  # список состоящий из кортежей
# dd = dict(lst)  # dict и переводиться как словарь и создает словарь {:,:,:}
# print(dd)

# lst = [11, 22, 33]  # если у нас просто список
# dd = dict.fromkeys(lst)  # метод fromkeys ставит элементы списка в ключи {11: None, 22: None, 33: None}
## а значения мы не давали
# print(dd)

# lst = [11, 22, 33]  # если у нас просто список
# dd = dict.fromkeys(lst, True)  # метод fromkeys {11: True, 22: True, 33: True}
# print(dd)

# lst = [11, 22, 33]  # если у нас просто список
# dd = dict.fromkeys(lst, 100)  # метод fromkeys {11: 100, 22: 100, 33: 100}
# print(dd)

# dd = {i: i**2 for i in range(10, 20)  # дикт компрехеншен!!!!!!!!!!!!!!!!!!!диапозон от 10 до 20
## т.е. i: i**2 ключ это i сначала 10, значение 10 в квадрате=100, далее с 11
# print(dd)  # распечатается {10: 100, 11: 121, 12: 144, 13: 169, 14: 196, 15: 225, 16: 256, 17: 289, 18: 324, 19: 361}
## аналогично записать циклом:
# dd = {}
# for i in range(10, 20):
#     dd[i] = i**2
# print(dd)

"""----------------------------def--------------------return-------------------------
-----ФУНКЦИЯ------это некая подпрограмма которая выполняется когда её попросят(вызовут), любое кол раз
# разделяют функции и процедуры, функционально-процедурное программирование
# если def функция без оператора return(не возвращает результат только декларирует??) то это процедура, 
# мы с ней ничего не сделаем??
"""
# def summator(a, b):  # def ключевое слово далее имя функции, параметры
# # при вызове функции в параметры передаются аргументы
# # вариант def summator(a=10, b=4): если параметры пишем по умолчанию тут то пробелы не ставим у оператора =
# # и не передаем пргументы просто вызываем и печатаем print(summator()) или переприсваеваем print(summator(b=8))
# # вариант def summator(a, b=4): для а передать print(summator(5))
#     print(a + b, " - это a + b из блока с def до return")  # эти две строки def и print, если нет return - то это процедура
#     return a * b  # напечатает одно, а вернет другое!
#     # между функциями def и def должны быть две строки

# # конструкция "аргс", "кей ворк аргс"
# def printing(*args, **kwargs):  # "кей ворк аргс" ключевые аргументы(?после позиционных аргументов)
#     print(args)  # выведется кортеж (1, 4) с позиционными аргументами
#     print(kwargs)  # выведется словарь с ключеавми аргументами {'nn': 16, 'y': 45}
#     #return sum(args)


## n = 45  # просто для примера что программа чем то заполнена
## cc = "qwerty"  # просто для примера что программа чем то заполнена

# n = summator(2, 3)  # без return который в def выше, print будет выводить None!!!!но print внутри def будет свое печатать
# print("функция", n, " - это a * b после return")  #
#
# ## print(summator(2))  # позиционные аргументы "на позицию", вызов/запуск функции сумматор
# ## print(summator())  # просто вывод после return
# ## print(summator(b=8))  # ключевые аргументы (переприсваиваем аргумент, который считывается парой ключ:значение) выводит при параметрах по умолчанию иное
# print(summator(5, 10))  # 5 и 10 уходят в строку def, там принтом выводят 15(5+10),
# # а тут принтом выводит 50(5*10) потому что return a * b

# print(printing())  # без return который в def выше, print будет выводить None!!!!но print внутри def будет свое печатать
# # если будет return у def то выведется то что получиться после ретерн, например 0
# print(printing(1, 3))  # если return sum(args) то выведется 4(1+3)
# print(printing(1, 3, nn=16, y=45))  # вызывается функция printing и эти аргументы передаются в параметры,
# # 1, 3 это позиционные аргументы, а nn=16, y=45 ключевые, образуют словарь {'nn': 16, 'y': 45}
# printing("Name1", "Name2", "Name3")
# printing("Name1", "Name2")














