"""Операции сравнения- приводит к булеву результату"""
""" >, <, >=, <=, =, ≠ это !=, == """
"""
Логические операции: ()(скобки управляют порядком), not(не), and(логическое сложение), or(логическое умножение)
True and True and False and ... = False
True or True or False or ... = True
ветвление проверяет True or False
"""

# a = 66
# b = 36
# c = a > b
# print(c)

# if a > b:
#     print('A > B')
# elif a < b:
#     print('A < B')
# else:
#     if a < b:
#         print('A < B')
#     else:
#         print('A = B')
#
# print('END')
#
#
# h = float(input(''))
#
#
# h = float(input('Введите время суток: '))
# if h >= 4 and h < 12:
#     print('Morning')
# elif 12 ≤ h < 17:
#     print('Day')
# elif h >=
# else:


# color = input('Цвет светофора: ')
# match color:
#     case 'red' | 'no':
#         print('STOP')
#
#     case 'green':
#         print('GO')
#     case 'yellow':
#         print('Ready')
#     case _:
#         print('цвет', color)


# for _ in 23, 45, 22, 32:
#     print('YES')


# for i in 23, 45, 22:
#     print(i, 'YES')


# for i in range(0, 10, 2):   # Start=0, Stop, Step=+1
#     print(i * 2, end=' ')
# print()
# print(i)


# n = 10
# for i in range(20, n-1, -1):   # Start=0, Stop, Step=+1
#     print(i, end=' ')
# print()
# print(i)


# вывели таблицу умножения
# for i in range(1, 10):
#     for j in range(1, 10):
#         print(f'{i * j}', end=' ')
#     print()

#----------07.09.2026---------------------------------------------
#
# from turtle import *
#
# shape('turtle')
# speed(0)
# colormode(255)
# pensize(4)
# r = 255
# g = 255
# b = 0
# br = 0
# bg = 255
# bb = 0
# color((br, bg, bb), (r,g,b))
#
# for j in range(150, 10, -25):
#     # fillcolor(r,g,b)
#     color((br, bg, bb), (r,g,b))
#     for i in range(8):
#         # fillcolor()
#         begin_fill()
#         circle(j)
#         end_fill()
#         rt(45)
#     r -= 3
#     g -= 15
#     b += 30
#     br += 30
#     bg -= 30
#     bb += 30
#
# mainloop()



# i = 0
# while i < 10:
#     i += 1  # i = i + 1
#     if i == 7:
#         continue
#     print(i, end=' ')
# print()
# # две строки
# i = 0
# while i < 10:
#     i += 1  # i = i + 1
#     if i == 17:
#         break
#     print(i, end=' ')
# else:
#     print('\nОК')


# n = int(input('> '))
# sm = 0
# cnt = 0
# while n != 0:
#     sm += n    # print(n)
#     cnt += 1
#     n = int(input('> '))
#
# print(f'Сумма - {sm}\n'
#       f'Кол-во - {cnt}')


"""
s = 3 + 2 + 1
k = 1 + 1 + 1
123 % 10 = 3
   // 10 = 12 % 10 = 2
             // 10 = 1 % 10 = 1
                      // 10 = 0
"""
import copy

# n = int(input('> '))
# nn = n
# sm = 0
# cnt = 0
# while n > 0:
#     rem = n % 10
#     sm += rem
#     cnt += 1
#     n //= 10
#
# print(f'В числе {nn} {cnt} ц. суммой {sm}')


# s = 'Здравствуйте, гости!'
# print(s[0])
# print(s[6])
# print(s[-1])
# print(len(s))
# print(s[::1])
# print(s[:])
# print(s[:12])
# print(s[::-1])
# print(reversed(s))
# print(list(reversed(s)))
# # for i in s:
# #     print(i, end=' ')
# print(s[19])
# for i in range(len(s)):
#     print(s[i], end='  ')

# s = ' Здравствуйте, гости!'
# print(s.isalpha())
# s1 = '12345'
# print(s1.isdigit())
# print(s1.islower())
# print(s1.isupper())
# print(s.startswith('3'))
# print(s.endswith('!'))
# print(n := s.lower())
# print(n)
# print(s)
# print('res', 'и!' in s)
# print(s.upper())
# print(s.title())  # все слова начинаются с большой буквы
# print(s.capitalize())  # переменная начинаются с большой буквы(в предложении первая буква большая)
# print(s.rjust(40))  # переменная пишется в 40 знакоместах выравнивание по правому краю
# print(s.ljust(40))  # переменная пишется в 40 знакоместах выравнивание по левому краю
# print(s.center(40))  # выравнивание по центру
# print(s.strip())  # удаляем пробелы по краям
# print(s.strip("!Зд "))  # убрать символы перечислить начиная с краев!, если "З" не с краю то пробел тоже перечислить
# print(s.rstrip())  # удаляем пробелы справа
# print(s.rstrip(" "))
# print(s.lstrip())
# print(s.index(','))  # ищем запятую
# print(s.index('т', 8, 12))  # не входит(ошибка), "т" в индексы с 8 до 11! как с индексами стоп 12 не входит
# print(s.find('т', 8, 11))  # "фаенд" "т" в индексы с 8 до 10!, если не нашел то ошибку не выводит, но -1
# print(s.replace("т", "LN").replace(",", ""))  # "т" поменять на "LN" и запятую заменить ничем

# s = ' Здравствуйте, гости!'
# print(s.split())  # из строк тип данных(str) выводит с квадратными скобками коллекцию - список(list)
#= ['Здравствуйте,', 'гости!']  разделяя по пробелу (Здравствуйте,), (гости!)
# т.е. забирается пробел ставится между стандарт (, )
# ls = s.split()  # тоже самое
# ls = s.split(", ")  # по запятой и пробелу
#= [' Здравствуйте', 'гости!']  разделяя по запятой и пробелу (Здравствуйте), (гости!)
# т.е. забирается запятая! и пробел ставится между стандарт (, )
# print(ls)  # выводится коллекция/список с именем ls
# print(", ".join(ls))  # указали разделитель (, ) "джоин"- присоединить, из списка(list) вернули опять в строку(str)
#=  Здравствуйте, гости!

#----------списки--------------------14.09.2026--------------[False,7,9.5,{},(""),[,]]-----[]---------------------------
"""List"""
"""Список - упорядоченный набор объектов, 
структура данных массив, но с динамической типизацией и изменяемым размером(не классический массив), 
внутри может быть еще вложенный список(list), int, float, str, tuple, dict, bool, sets
могут быть повторяющиеся элементы
"""
"""       0   1   2   3   4   5   6   7   8   9 - положительные индексы"""
# num = [22, 33, 44, 55, 99]  # коллекция с объектами
"""      -5  -4  -3  -2  -1  - отрицательные индексы"""
# print(num[0])
# print(num[2])
# print(num[1:-2])  #= [33, 44]  срез- это новый объект почемуто????
# print(num)  # изначальный список не изменился= [22, 33, 44, 55, 99]
# print(num[::2])
# print(num[2::])
# print(num[2::-1])  # с 44 в обратную сторону
# print(num[::-1])


# nn = num  # теперь у переменных общая ссылка на список
# num[1] = 3333  # на первый индекс у num добавили 3333, но в nn стало также потому что у них одна ссылка nn = num
# print((num), id(num))  # вывели список и его айди
# print((nn), id(nn))  # тоже самое изза nn = num
# print(nn is num)  # вопрос nn это num ? ответ True


# num = [22, 33, 44, 55, 99]
# nn1 = num[:]  # через срез создаем новый объект и тогда у списка nn и num разные индексы
# print(nn is num)  # вопрос nn это num ? ответ False
# более распространенный метод поверхностного копирования
# nn = num.copy()  # nn и num разные индексы


# num = [1, 2, [32, 4]]  # три объекта в списке/коллекции внутри него(вложеннный) еще список с двумя
# nn = num.copy()  # nn и num разные индексы
# num[1] = 3333  # на первый индекс у num добавили 3333,
# но в nn НЕ стало также, потому что скопировали num и создали новый обьект в nn
# num[-1][1] = 400  # меняем у крайнего справа обьекта/коллекции [32, 4] обьект по индексу 1 это 4 на 400
# print(num, id(num))  # [1, 3333, [32, 400]] 4344165824
# print(nn, id(nn))  # [1, 2, [32, 400]] 4345180352
# у nn и у num разные ссылки на коллекцию внешнюю, но общая ссылка на внутреннюю [32, 4],
# поэтому изменив в num [-1][1] помнялось и в nn


# num = [1, 2, [32, 4]]  # три объекта в списке/коллекции внутри него(вложеннный) еще список с двумя
# nn = copy.deepcopy(num)  # глубокое копирование, каждому списку содается вложенный обьект, что бы не было зависимостей
# num[1] = 3333  # на первый индекс у num добавили 3333,
# но в nn НЕ стало также, потому что скопировали num и создали новый обьект в nn
# num[-1][1] = 400  # меняем у крайнего справа обьекта/коллекции [32, 4] обьект по индексу 1 это 4 на 400
# print(num, id(num))  # [1, 3333, [32, 400]] 4298585536
# print(nn, id(nn))  # [1, 2, [32, 4]] 4309086400


# num = [22, 100, 44, 100, 99]
# num[5] = 100  # ошибка! хотим пятому индексу присвоить 100 напрямую, индекс не в диапозоне, рьращаемся к не сущ инд
# print(num)

# num = [22, 33, 44, 55, 99]
# num.append(100)  # добавить в конец списка 0(1) канстантная
# print(num)  # [22, 33, 44, 55, 99, 100]  # список изменился
# num.insert(0, 300)  # поставить 300 на индекс 0 это где 22, 0(n) линейная временная сложность
# для этого под капотом будут сдвигаться все обьекты вправо
# print(num)  # [300, 22, 33, 44, 55, 99, 100]
# аппенд выполнитя быстрее чем инсерт

# num = [22, 33, 44, 55, 99]
# print(num, id(num))  # выведем id   [22, 33, 44, 55, 99] 4333177088
# num.extend([1, 2])  # список [1, 2] присоединяем в конец к num= [22, 33, 44, 55, 99, 1, 2]
# print(num)  # список изменился
# num += [1, 2]  # тоже самое, изменение «на месте», id(num) не меняется
# print(num, id(num))  # список изменился, id нет   [22, 33, 44, 55, 99, 1, 2] 4333177088
# num = num + [1, 2]  # создается новый обьект изза конкатенации и num назначается на нов обьект,
# старый список остается нетронутым(если на него есть другие ссылки), id(num) после операции будет другим
# print(num, id(num))  # [22, 33, 44, 55, 99, 1, 2, 1, 2] 4334350016   !id изменился
# то бы не занимать память луче исп экстенд или +=

# num.append([1, 2])  # список [1, 2] присоединяем в конец к num как вложенный!= [22, 33, 44, 55, 99, [1, 2]]
# print(num)  # список изменился

# num.pop()  # удаляет значение с конца списка
# print(num)
# n = num.pop()  # можно присвоить удаленное значение переменной n, потому что pop возвращает значение
# так же линейная сложность индексы смещаются для удаления
# nn = num.pop(0)  # удаление по индексу
# print(n, nn)
# print(num)
## num.remove(100)  # убирает только первое вхождение в список этого значения из скобок, если не окажется 100 то ошибка!
# print(num)
##print(num.index(100))  # получаем индекс значения из скобок, если не окажется 100 то ошибка!

# while 100 in num:  # удалить все сотни из списка(количество циклов не известно)
#     num.remove(100)
#     print(num)

# print(num.count(100))  # считает количество повторений символа из скобок

## num.clear()  # получим пустой список= []
# print(num)



# num = [False, 33, 4.4, [55, 99], '11']
# for i in range(len(num)):  # итерируем(перебрать) список num столько раз сколько есть элементов в списке(5 т.е. 0-4)
#     print(i, num[i], end="   ")  # вывести индекс цикла с 0, элемент из списка с этим индексом и разделить это "   "
#= 0 False   1 33   2 4.4   3 [55, 99]   4 11

# print()  # без этого принта результат следующего цикла печатается слитно с этим

# второй способ
# cnt=0  # счетчик перед циклом с нуля, если не идем по индексам
# for i in num:  # идет не по индексам, а по значениям/обьектам, последний цикл=последний обьект
#     print(cnt, i, end="   ")
#     cnt += 1  # увеличиваем счетчик при каждом цикле(имитация следующего индекса)
#= 0 False   1 33   2 4.4   3 [55, 99]   4 11

# print()  # без этого принта результат следующего цикла печатается слитно с этим

# третий способ лучший, 'енумерейт'-пронумеруй всё по порядку, начиная с нуля, для каждой вещи сразу делает пару
# for i in enumerate(num):  # i=пара (номер, вещь), номер 0, вещь False, номер 1, вещь 33...
#     print(i[0], i[1], end="   ")  # разделяем номер и вещь, ставим между ними "   "
#= 0 False   1 33   2 4.4   3 [55, 99]   4 11

# print()  # без этого принта результат следующего цикла печатается слитно с этим

# тоже самое
# r (rank, row) ряд, позиция, номер
# i (item) вещь, предмет
# for r, i in enumerate(num):  #
#     print(r, i, end="   ")  #
#= 0 False   1 33   2 4.4   3 [55, 99]   4 11


# names.sort() # сортировка по порядку(алфавиту)
##names.reverse()  # переворачивает список в обратную сторону и names !перезаписался
##names.sort(reverse=True)  # сортировка порядку(алфавиту) !но в обратном порядке


# k — это ключ (от английского key), i (item) вещь, предмет
# names = ["Dasha", "Masha", "Sasha", "Glasha", "Andryusha"]  # хотим вывести отсортированными и пронумерованными
# for k, i in enumerate(names, 1):  # отсчет с единицы
#     print(f"{k}. {i}")  # k типа индекса с 1, потом точка и обьект из списка
##= 1. Dasha
##= 2. Masha
##= 3. Sasha
##= 4. Glasha
##= 5. Andryusha

# names = ["Dasha", "Masha", "Sasha", "Glasha", "Andryusha"]  # хотим вывести отсортированными и пронумерованными
# age = (22, 33, 44, 55, 11)
# for i in zip (names, age):  # zip
#     print(i)  # получаем кортеж запакованный
##= ('Dasha', 22)
##= ('Masha', 33)
##= ('Sasha', 44)
##= ('Glasha', 55)
##= ('Andryusha', 11)

# for k, i in zip (names, age):
#     print(k, i)
##= Dasha 22
##= Masha 33
##= Sasha 44
##= Glasha 55
##= Andryusha 11


# names = ("Dasha", "Masha", "Sasha", "Glasha", "Andryusha")  # кортеж
# age = (22, 33, 44, 55, 11)  # кортеж
# for r, (n, a) in enumerate(zip(names, age), 1):  # с единицы начинается нумерация, с распаковкой
#     print(f'{r}. {n} - {a}')
##= 1. Dasha - 22
##= 2. Masha - 33
##= 3. Sasha - 44
##= 4. Glasha - 55
##= 5. Andryusha - 11

# предпочтительнее запись persones вместо names и age
# persones = [('Dasha', 22), ('Masha', 33)]


# nmn = [2, 3, 4, 5, 9, 1]
# age = (22, 33, 44, 55, 11)
# for k, i in zip (nmn, age):
#     print(i - k)  # арифметическая операция в теле цикла
## = 20
## = 30
## = 40
## = 50
## = 2

# arr = [0] * 10  # создаем массив(список) из десяти нулей
# print(arr)  #= [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
# for i in range(len(arr)):  # заполняем массив arr берем по индексу от 0 до 9
#     arr[i] = i + 1  # на каждом цикле прибавляем по единице
# print(arr)  #= [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]



# ls = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(5 if len(ls) > 7 else 125)  # тернарный оператор(унарное выражение), условие если длина списка больше чем 7, то выведется 5,
##если иначе то выведется 125
# print(5 if len(ls) < 7 else 125)  # 125



# ls = []
# for i in range(10):
#     ls.append(i + 1)
# print(ls)  # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# работает быстрее чем цикл выше(потому что память сразу определена колвом значений,
# т.е. список знает какой ему нужен размер для того что нужно сделать заполнить массив)
# ls = [i + 1 for i in range(10)]  # лист компрехеншен(унарное выражение)- конструкция, создаем список из
# print(ls)  # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]



# ls = []
# for i in range(10):
#     if i > 1:
#         if (i + 1) % 2 == 0:
#             ls.append(i + 1)
#         else:
#             ls.append(i)
# print(ls)  # [2, 4, 4, 6, 6, 8, 8, 10]

# тоже что и цикл выше, но вместо 8 строк две! и выполняется быстрее
# применили тернарный оператор(бинарное деление) в лист компрехеншен(унарное выражение)
# ls = [i + 1 if (i + 1) % 2 == 0 else i for i in range(10) if i > 1]
# print(ls)  # [2, 4, 4, 6, 6, 8, 8, 10]



"""(Tuple) 'тьюпл' работает быстрее чем список потому что не расширяемый, у него нет изменения размера(,,,,,)"""
"""Кортеж - упорядоченный набор не изменяемых объектов(нельзя добавлять/удалять)"""

# tp = (22, 33, 44, 99)  # кортеж
# K = 7,  # запятая дает тип кортеж(tuple) 'тьюпл' из одного обьекта, заглавная это константа
# print(K, type(K), K[0])  #= (7,) <class 'tuple'> 7   K[1]вытянуть не сможем мы его не задали

# k, i, *z = 7, 5, 9, 10, 1, 32, 56, 100,
# print(k, i, z)  # 7 5 [9, 10, 1, 32, 56, 100]
# k, *i, z = 7, 5, 9, 10, 1, 32, 56, 100,   # *дает сбор в коллекцию/список кроме крайних упаковщик звездочка,
# запятая дает тип кортеж(tuple) 'тьюпл'
# print(k, i, z)  # 7 [5, 9, 10, 1, 32, 56] 100
# print(k, *i, z)  # *распаковка=  7 5 9 10 1 32 56 100

# tp = ("login", "password")  # кортеж ! он н изменяем
# print(tp, id(tp))  # ('login', 'password') 4318801856
# buf = list(tp)  # приводит к списку list[] чтобы изменить!
# buf[-1] = "new_password"  # в списке меняем по индексу
# print(buf, id(buf))  # ['login', 'new_password'] 4321439424
# tp = tuple(buf)  # приводит к кортежу tuple()
# print(tp, id(tp))  # ('login', 'new_password') 4318880832


"""левый циклический сдвиг (на место 22 должны записать 33, на место 33 записать 44....на место 99 зап 22)"""

# задача сдвинуть значения в списке, чтобы первый стал последним
# l = [22, 33, 44, 55, 99]  # список
# temp = l[0]  # значение 22 это 0 по индексу присваеваем чтобы использовать
# n = len(l)  # берем длину списка это 5(от 0 до 4)
# for i in range(n-1):  # задаем в цикл 4(5-1) итерации от 0 до 3
#     l[i] = l[i + 1]  # в первой итерации на индекс 0 списка l это 22 идет значение с индекса 0+1 т.е. [1] это 33
#     ## во второй итерации на индекс 1 списка l это 33 идет значение с индекса 1+1 т.е. [2] это 44
#     ## в третьей итерации на индекс 2 списка l это 44 идет значение с индекса 2+1 т.е. [3] это 55
#     ## в четвертой итерации на индекс 3 списка l это 55 идет значение с индекса 3+1 т.е. [4] это 99
# l[-1] = temp  # значение 22 из temp кладем в место под индексом -1 там где было 99
# print(l)  # [33, 44, 55, 99, 22]


# если обойтись без цикла(этот вариант быстрее, предпочтительнее)
# l = [22, 33, 44, 55, 99]  # список
# temp = l.pop(0)  # удаляет нулевой элемент из коллекции это 22 и кидает его в temp
# l.append(temp)  # из temp 22 с помощью .append добавляется в конец списка
# print(l)  # [33, 44, 55, 99, 22]


# задача поменять значения x и y местами
# x = 10
# y = 15
# print(x, y)  # 10 15
# z = x  # вводим третью переменную z, переприсваиваем
# x = y
# y = z
# print(x, y)  # 15 10
# x, y = y, x  # перекрестно переприсвоили (быстро)
# print(x, y)  # 10 15
# x, y, z = y, x, 3
# print(x, y, z)  # 15 10 3
# x, *y = y, x, 3
# print(x, y)  # 15 [10, 3]





